
// 복습 및 예제

package review;

import java.util.Scanner;

public class Review {
	public static void main(String[] args) {



//<코인노래방 프로그램> =========================================================
//
//메뉴
//	1. 금액 입력하기
//		노래 한 곡당 300원,
//		금액을 입력 받아서 부를 수 있는 곡 수
//		잔돈을 반환 한다.
//	2. 노래 부르기
//		노래 점수가 랜덤으로 나온다.
//		이 때 노래 점수가 80점 이상이면 노래 한 곡응ㄹ 서비스로 준다.
//		50점 미만이면 노래 한 곡 차감
//	3. 나의 실력 확인하기
//		지금까지 불렀던 노래의 평균 점수가 보여진다.
//	4. 종료
//				프로그램이 종료된다.
		
	


//<랜덤 게임> =========================================================
//	1. 1단계(배당 1.5배)
//	1~5 사이의 숫자 맞추기
//	2. 2단계(3배)
//	1~10 사이의 숫자 맞추기
//	3. 3단계(5배)
//	1~20 사이의 숫자 맞추기
//	4. 누적 손익 확인
//	현재까지 번 돈 : 70000원
//	현재까지 잃은 돈 : 60000원
//	손익 : 10000원
//	5. 종료

//게임의 규칙
//사용자에게 정수를 입력받는다.
//사용자에게 배팅 금액을 입력받는다.
//이 때 숫자를 맞추면 배당만큼 수익을 얻는다.
//숫자를 맞추지 못한다면 배팅한 금액은 모두 잃는다.



// =========================================================
// 사용자에게 국어 영어 수학점수를 차례로 입력받아서
// 총점과 평균 출력하기(배열을 활용해서)

//	사용자에게 입력할 숫자의 갯수를 입력받는다.
//	5 --> 5개의 숫자를 입력한다는 의미
//
//	정수2 >> 15
//	정수1 >> 10
//	정수3 >> 9
//	정수4 >> 18
//	정수5 >> 30
//
//	사용자가 입력한 숫자만큼 정수를 입력받아서
//	배열 모양으로 출력하기
//	{10, 15, 9, 18, 30 }
//	그 정수들 중 가장 큰 값과 작은 값을 출력하라
//	가장 큰 값: 30
//	가장 작은 값: 9
		

		
	}
}
